# pandas Basics

- In this homework assignment, you will practice selecting, sorting, and aggregating data in a DataFrame. 
- Follow each *TODO* instruction to write a Python code snippet with pandas and Numpy. Include the output of each code cell.

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

**TODO 1**
Consider the following Python dictionary `adict`. 

```python
adict = {'state': ['New York', 'California', 'Maryland'], 
         'pop2010': [19378, 37254, 5774],
         'pop2018': [19542, 39557, 6043],
         'rev2010': [71545, 112372, 17064],
         'rev2018': [88541, 175017, 22427]}
```

Notation:

- `pop2010`: state's 2010 population (in thousand)
- `pop2018`: state's 2018 population (in thousand)
- `rev2010`: state's 2010 tax revenue (in million USD)
- `rev2018`: state's 2018 tax revenue (in million USD)

Construct a DataFrame `frame` from dictionary `adict`. The row label (index) of each state is its abbreviation, i.e., `NY`, `CA` or `MD`.

In [88]:
#####TODO 1#####
pass
adict={'state':['NY','CA','MD'],'pop2010': [19378, 37254, 5774],
         'pop2018': [19542, 39557, 6043],
         'rev2010': [71545, 112372, 17064],
         'rev2018': [88541, 175017, 22427]}
frame=DataFrame(adict)
frame

  state  pop2010  pop2018  rev2010  rev2018
0    NY    19378    19542    71545    88541
1    CA    37254    39557   112372   175017
2    MD     5774     6043    17064    22427

**TODO 2**
It is known that the areas of the three states are 54555, 163695 and 12406 square miles. Add a column `area` with appropriate data to DataFrame `frame`.

In [89]:
#####TODO 2#####
pass
area=[54555,163695,12406]
frame['area']=area
frame

  state  pop2010  pop2018  rev2010  rev2018    area
0    NY    19378    19542    71545    88541   54555
1    CA    37254    39557   112372   175017  163695
2    MD     5774     6043    17064    22427   12406

**TODO 3** 
Select the first row and the last row of DataFrame `frame`.

In [90]:
#####TODO 3#####
pass
frame.iloc[[0,2]]

  state  pop2010  pop2018  rev2010  rev2018   area
0    NY    19378    19542    71545    88541  54555
2    MD     5774     6043    17064    22427  12406

**TODO 4**
Select just columns `state`, `pop2018` and `area` from DataFrame `frame`.

In [91]:
#####TODO 4#####
pass
frame[['state','pop2018','area']]

  state  pop2018    area
0    NY    19542   54555
1    CA    39557  163695
2    MD     6043   12406

**TODO 5**
Select the New York state's population data in 2010 and 2018.

In [92]:
#####TODO 5#####
pass
frame.iloc[0,[1,2]]

pop2010    19378
pop2018    19542
Name: 0, dtype: object

**TODO 6**
Show the row labels of the second row and the third row.

In [93]:
#####TODO 6#####
pass
frame.iloc[[1,2],0]

1    CA
2    MD
Name: state, dtype: object

**TODO 7**
Select just columns `state`, `rev2010` and `rev2018` of the second row and the third row from DataFrame `frame`.

In [94]:
#####TODO 7#####
pass
frame.iloc[1:3,[0,1,2]]

  state  pop2010  pop2018
1    CA    37254    39557
2    MD     5774     6043

**TODO 8** Select only the rows from DataFrame `frame` with an area greater than 50,000.

In [95]:
#####TODO 8#####
pass
frame[frame.area>50000]

  state  pop2010  pop2018  rev2010  rev2018    area
0    NY    19378    19542    71545    88541   54555
1    CA    37254    39557   112372   175017  163695

**TODO 9** 
Add a column `popchange` to DataFrame `frame`. Assign the percentage change from 2010 to 2018 in each state's population to this new column.

In [96]:
#####TODO 9#####
pass
popchange=frame.iloc[:,[2]].values/frame.iloc[:,[1]].values-1
frame['popchange']=popchange
frame

  state  pop2010  pop2018  rev2010  rev2018    area  popchange
0    NY    19378    19542    71545    88541   54555   0.008463
1    CA    37254    39557   112372   175017  163695   0.061819
2    MD     5774     6043    17064    22427   12406   0.046588

**TODO 10** 
Sort DataFrame `frame` by the index.

In [97]:
#####TODO 10#####
pass
frame.sort_index()

  state  pop2010  pop2018  rev2010  rev2018    area  popchange
0    NY    19378    19542    71545    88541   54555   0.008463
1    CA    37254    39557   112372   175017  163695   0.061819
2    MD     5774     6043    17064    22427   12406   0.046588

**TODO 11**
Sort DataFrame `frame` by the 2018 population in descending order.

In [98]:
#####TODO 11#####
pass
frame.sort_index(by='pop2018',ascending=False)

C:\Users\xueme\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  This is separate from the ipykernel package so we can avoid doing imports until

  state  pop2010  pop2018  rev2010  rev2018    area  popchange
1    CA    37254    39557   112372   175017  163695   0.061819
0    NY    19378    19542    71545    88541   54555   0.008463
2    MD     5774     6043    17064    22427   12406   0.046588

**TODO 12**
Compute the total tax revenue across the three states in DataFrame `frame`.

In [99]:
####TODO 12####
pass
frame.iloc[:,[3,4]].sum()

rev2010    200981
rev2018    285985
dtype: int64

**TODO 13** In how many states did the tax reveue increase by at least 30%?

In [100]:
#####TODO 13#####
pass
len(frame[frame.iloc[:,[4]].values/frame.iloc[:,[3]].values-1>0.3].index)

2

**TODO 14** 
Return the index of the row with the highest `popchange` value.

In [101]:
#####TODO 14#####
pass
frame.iloc[:,-1].idxmax()

1

**TODO 15**
Replace Maryland's `popchange` value by `np.NaN`. Then count the number of rows in the DataFrame with one or more missing values.

Hint: use methods `isnull()` and `any(axis = 1)`.

In [102]:
#####TODO 15#####
pass
frame.iloc[:,-1]=np.NaN
frame

  state  pop2010  pop2018  rev2010  rev2018    area  popchange
0    NY    19378    19542    71545    88541   54555        NaN
1    CA    37254    39557   112372   175017  163695        NaN
2    MD     5774     6043    17064    22427   12406        NaN

In [115]:
len(frame[frame.isnull()>=1].index)

3